app/controllers/alumnos_controller.rb

  def index
    @alumnos = Alumno.all
---
SELECT * FROM `alumnos`

  def show
    @alumno = Alumno.find(params[:id])
---
SELECT * FROM `alumnos` WHERE (`alumnos`.`id` = 1)

  def create
    @alumno = Alumno.new(params[:alumno])
     respond_to do |format|
      if @alumno.save
---
INSERT INTO `alumnos` (`created_at`, `nombre`, `updated_at`, `email`) VALUES('2010-07-24 06:54:16', 'Miguel Morales', '2010-07-24 06:54:16', 'm@algo.com')

  def destroy
    @alumno = Alumno.find(params[:id])
    @matriculas = Matricula.find_all_by_alumno_id(params[:id])
     @matriculas.each do |iter|
    iter.destroy
    end
    @alumno.destroy
---
SELECT * FROM `alumnos` WHERE (`alumnos`.`id` = 7)
SELECT * FROM `matriculas` WHERE (`matriculas`.`alumno_id` = '10') LIMIT 1
DELETE FROM `alumnos` WHERE `id` = 7