app/controllers/cursos_controller.rb

SELECT * FROM `cursos`
---
  def index
    @cursos = Curso.all

SELECT * FROM `cursos` WHERE (`cursos`.`id` = 1)
---
  def show
    @curso = Curso.find(params[:id])

INSERT INTO `cursos` (`created_at`, `nombre`, `updated_at`, `descripcion`) VALUES('2010-07-24 07:11:17', 'Natacion', '2010-07-24 07:11:17', 'Natacion')
---
  def create
    @curso = Curso.new(params[:curso])

    respond_to do |format|
      if @curso.save