app/controllers/matriculas_controller.rb

SELECT * FROM `matriculas`
---
  def index
    @matriculas = Matricula.all

SELECT * FROM `matriculas` WHERE (`matriculas`.`id` = 1)
---
  def show
    @matricula = Matricula.find(params[:id])

SELECT * FROM `matriculas` WHERE (`matriculas`.`id` = 7)
---
  def edit
    @matricula = Matricula.find(params[:id])

SELECT * FROM `matriculas` WHERE (`matriculas`.`alumno_id` IS NULL) LIMIT 1
INSERT INTO `matriculas` (`created_at`, `alumno_id`, `updated_at`, `curso_id`) VALUES('2010-07-29 10:28:33', 1, '2010-07-29 10:28:33', 1)
---
  def create
 # debugger
    if params[:commit]== 'ver_horario'
          redirect_to(:action => 'cuadro_horario', :cur_id =>params[:matricula][:curso_id])

    else
    params[:matricula][:alumno_id] = Alumno.find(:last).id
    @matricula = Matricula.new(params[:matricula])


    respond_to do |format|
    if @matricula.que_no_tenga_conflicto_con(@matricula)

      if @matricula.save

SELECT * FROM `matriculas` WHERE (`matriculas`.`id` = 7)
UPDATE `matriculas` SET `updated_at` = '2010-09-02 15:40:42', `curso_id` = 2 WHERE `id` = 7
---
  def update
    if params[:commit]== 'ver_horario'
          redirect_to(:action => 'cuadro_horario', :cur_id =>params[:matricula][:curso_id])

    else

    @matricula = Matricula.find(params[:id])
    params[:matricula][:alumno_id]= @matricula.alumno_id
    @prev = Matricula.new(params[:matricula])


    respond_to do |format|
    if @matricula.que_no_tenga_conflicto_con(@prev)

      if @matricula.update_attributes(params[:matricula])

SELECT * FROM `matriculas` WHERE (`matriculas`.`id` = 2)
DELETE FROM `matriculas` WHERE `id` = 2
---
  def destroy
    @matricula = Matricula.find(params[:id])
    @matricula.destroy

SELECT * FROM `horarios` WHERE (`horarios`.`curso_id` = 1) LIMIT 1
---
 def cuadro_horario

    horarios = Horario.find_all_by_curso_id(params[:cur_id])